// *++
//
// Copyright (c) 2005 - 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   StallStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell stall command
// 
// Revision History: 
// 
// --*/

/=#

#langdef   eng "English"

#string STR_STALL_SERVICES             #language eng  "%hs: Stall service not available\n"

#string STR_STALL_FOR                  #language eng  "Stall for %d uS\n"

#string STR_STALL_UNKNOWN_FLAG         #language eng  "%hs: Unknown flag - '%hs'\n"

#string STR_STALL_INVALID_ARG          #language eng  "%hs: Invalid value for microsecond - '%hs'\n"

#string STR_STALL_TOO_BIG              #language eng  "%hs: Out of range - '%hs'\n"

#string STR_STALL_LINE_HELP            #language eng  "Stalls the processor for the specified number of microseconds"

#string STR_STALL_VERBOSEHELP          #language eng  "Stalls the processor for the specified number of microseconds.\n"
                                                      "\n"
                                                      "STALL microseconds\n"
                                                      "\n"
                                                      "    microseconds - Microseconds to stall\n" 
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. STALL in emulation NT environment will sleep for 'microseconds'.\n"
                                                      "    2. STALL in some other platforms will wait for 'microseconds'.\n"
                                                      "    3. Microseconds is in decimal units.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "    Shell> stall 1000000\n"
                                                      "    Stall for 1000000 uS\n"
